#!/usr/bin/env python
# coding: utf-8

# У всіх завданнях не використовувати інструкцію "IF - ELIF - ELSE"
# 
# Завдання 1
#     Задано деякі числа A та B (int):
#         - Перевірити умову: "Число A є додатнє"
#         - Перевірити умову: "Число A парне"
#         - Перевірити умову: "Число A кратне 13"
#         - Перевірити умову: "Кожне із чисел A та B - парне"
#         - Перевірити умову: "Кожне із чисел A та B мають однакову парність "
# 
# Завдання 2
#     _виконане_
# 
# Завдання 3
#     Дано деякий символ Char. Вивести символи, що ідуть перед та після символу Char в кодовій таблиці ASCII
# 
# Завдання 4
#     Дана стрічка, що складається із двох слів розділених пробілом.
#     Слова та порядок букв в словах поміняйте місцями.
#     (Наприклад, "One Two" --> "owT enO")
# 
# 
# Програми помістіть на ГітХаб у папку Homework2

# In[ ]:


# Завдання 1:
a = int(input("A:"))
b = int(input("B:"))

print ("Число A є додатнє:", a > 0)
print ("Число A є парне:", (a % 2) == 0)
print ("Число A кратне 13:", (a % 13 == 0))
print ("Кожне із чисел A та B - парне:", (a % 2) == 0 and (b % 2) == 0)
print ("Кожне із чисел A та B мають однакову парність:", (((a % 2) == 0) and ((b % 2) == 0)) or (((a % 2) == 1) and ((b % 2) == 1)))


# In[4]:


# Завдання 3:
char = input("char:")
print(chr(ord(char) - 1),"\n", chr(ord(char) + 1), sep="")


# In[6]:


# Завдання 4:
inp = input("словосполучення: ")
print(inp[::-1])


# In[ ]:





# In[ ]:





# In[ ]:





# In[ ]:





# In[ ]:




